from flask import Flask
import random

app = Flask(__name__)

UNUSUAL_IDEAS = [
"🤖 Рассказать, как искусственный интеллект видит рецепт идеального борща.",
"🛸 Написать гайд: 'Как объяснить инопланетянам, почему котики правят Интернетом'.",
"🕰️ Описать один день из жизни программиста в 3026 году.",
"🍕 Выдвинуть теорию о том, что пицца — это на самом деле сложная геометрическая база данных.",
"💡 Придумать 5 альтернативных способов использования Flask (например, для управления кофеваркой)."

]






@app.route("/")
def hello_world():
    random_idea = random.choice(UNUSUAL_IDEAS)
    return f'''
    <h1>Привет </h1>
    <h3>Меня зовут Айрат</h3>
    <p>Мне 12 лет </p>
    <p>Этот блог будет об игре майнкрафт.</p>
    <p>С этим постом мне помог микрофреймворк Flask;</p>
    <p>Он помог мне с Шаблонизацией, Встроенным сервером для разработки, и т.д.</p>
    <p>Больше всего мне запомнилось как добавлять виртуальное окружение и как пользоваться VS Code.</p>
    <p>Кстати, кончились идеи для нового поста? <br> Вот рандомная идея: {random_idea}</p>
'''

app.run(debug=True)
